const login_ko = {
  로그인: '로그인',
  아이디: '아이디',
  비밀번호: '비밀번호',
  '로그인 상태 유지': '로그인 상태 유지',
  '로그인 정보를 입력해주세요.': '로그인 정보를 입력해주세요.',
  '로그인 요청에 실패하였습니다.': '로그인 요청에 실패하였습니다.',
  '아이디와 비밀번호를 정확히 입력해주세요.':
    '아이디와 비밀번호를 정확히 입력해주세요.',
  '계약이 만료된 계정입니다.': '계약이 만료된 계정입니다.',
  '서버 점검중입니다.': '서버 점검중입니다.',
  '교사 계정으로 로그인해주세요.': '교사 계정으로 로그인해주세요.'
}

const topmenu_ko = {
  학년: '학년',
  반: '반',
  초등학교: '초등학교',
  학습현황: '학습현황',
  수업설정: '수업설정',
  수업보기: '수업보기',
  '이용 가이드': '이용 가이드',
  문의하기: '문의하기',
  '교사 연수 신청': '교사 연수 신청'
}

const footer_ko = {
  개인정보처리방침: '개인정보처리방침',
  이용약관: '이용약관',
  운영정책: '운영정책',
  '사업자 등록번호': '사업자 등록번호',
  통신판매업신고번호: '통신판매업신고번호',
  '2023-서울금천-제0177 호': '2023-서울금천-제0177 호',
  이메일: '이메일',
  연락처: '연락처',
  팩스: '팩스',
  주소: '주소',
  '서울시 금천구 디지털 9길 46 이엔씨드림타워 7차 503호':
    '서울시 금천구 디지털 9길 46 이엔씨드림타워 7차 503호'
}

const learningstatus_ko = {
  '단원 선택': '단원 선택',
  교과서: '교과서',
  학습결과: '학습결과',
  '평균 진행률': '평균 진행률',
  번호: '번호',
  이름: '이름',
  아이디: '아이디',
  닉네임: '닉네임',
  '학습 진행률': '학습 진행률',
  '미션 진행률': '미션 진행률',
  정답률: '정답률',
  학습시간: '학습시간',
  학습상세: '학습상세',
  분: '분',
  단원: '단원'
}

const learningdetail_ko = {
  '전체 단원 학습 현황': '전체 단원 학습 현황',
  진행률: '진행률',
  정답률: '정답률',
  단어: '단어',
  문장: '문장',
  대화: '대화',
  '마지막 로그인': '마지막 로그인',
  '단원 선택': '단원 선택',
  '단원별 학습 현황을 확인할 수 있습니다.':
    '단원별 학습 현황을 확인할 수 있습니다.',
  액티비티: '액티비티',
  'AI 발음평가': 'AI 발음평가',
  'AI 대화': 'AI 대화',
  교사미션: '교사미션',
  '정답률 - 단원별': '정답률 - 단원별',
  '정답률 - 영역별': '정답률 - 영역별',
  '학습 문제수': '학습 문제수',
  '학습 내용을 숫자로 확인할 수 있습니다.':
    '학습 내용을 숫자로 확인할 수 있습니다.',
  '각 영역별 정답률을 반 평균과 비교하여 확인할 수 있습니다.':
    '각 영역별 정답률을 반 평균과 비교하여 확인할 수 있습니다.',
  '학습 상세': '학습 상세',
  '학습자의 상세 학습 내용을 상세하게 확인할 수 있습니다.':
    '학습자의 상세 학습 내용을 상세하게 확인할 수 있습니다.',
  '듣기 버튼을 누르면 재생할 수 있습니다.':
    '듣기 버튼을 누르면 재생할 수 있습니다.',
  나: '나',
  반평균: '반평균',
  철자: '철자',
  어순: '어순',
  의미: '의미',
  말하기: '말하기',
  소리: '소리'
}

const pron_ko = {
  '발음 평가 상세': '발음 평가 상세',
  "액티비티 '스피킹' 영역에서 진행한 발음평가 상세 리포트입니다.":
    "액티비티 '스피킹' 영역에서 진행한 발음평가 상세 리포트입니다.",
  '세부 음소 발음 정확성을 측정합니다.': '세부 음소 발음 정확성을 측정합니다.',
  '전체 문장의 높낮이를 원어민 음성과 비교하여 측정합니다.':
    '전체 문장의 높낮이를 원어민 음성과 비교하여 측정합니다.',
  '단어의 강세위치, 발음 등을 원어민 음성과 비교하여 측정합니다.':
    '단어의 강세위치, 발음 등을 원어민 음성과 비교하여 측정합니다.',
  '문장의 자연스러운 리듬, 강조를 위한 끊어읽기 부분을 얼마나':
    '문장의 자연스러운 리듬, 강조를 위한 끊어읽기 부분을 얼마나',
  '자연스럽게 말했는지 측정합니다.': '자연스럽게 말했는지 측정합니다.',
  속도: '속도',
  '발화 속도를 원어민 음성과 비교하여 측정합니다.':
    '발화 속도를 원어민 음성과 비교하여 측정합니다.',
  '발음 집중학습 결과': '발음 집중학습 결과',
  "액티비티 '스피킹' 영역에서 학생들이 부족한 발음을 집중학습한 결과입니다.":
    "액티비티 '스피킹' 영역에서 학생들이 부족한 발음을 집중학습한 결과입니다.",
  문장: '문장',
  '집중 학습 단어': '집중 학습 단어',
  '집중 학습 음소': '집중 학습 음소'
}

const conversation_ko = {
  주제: '주제',
  힌트: '힌트',
  '교과서 대화 연습': '교과서 대화 연습',
  '자유 대화 연습': '자유 대화 연습',
  '이번 단원과 연계된 대화 연습 내용입니다.':
    '이번 단원과 연계된 대화 연습 내용입니다.',
  회: '회',
  '교과서 대화': '교과서 대화',
  '교과주제 대화': '교과 주제 대화',
  '교사 주제': '교사 주제',
  '자유 대화': '자유 대화',
  '교과서 대화 내역이 없습니다.': '교과서 대화 내역이 없습니다.',
  '교사 주제 대화 내역이 없습니다.': '교사 주제 대화 내역이 없습니다.',
  'GPT 교과 주제 대화 내역이 없습니다.': 'GPT 교과 주제 대화 내역이 없습니다.',
  'GPT 자유 주제 대화 내역이 없습니다.': 'GPT 자유 주제 대화 내역이 없습니다.',
  '교수자 또는 학습자가 정한 주제로 연습한 대화내역을 볼 수 있습니다.':
    '교수자 또는 학습자가 정한 주제로 연습한 대화내역을 볼 수 있습니다.',
  '이번 단원과 연계된 대화 연습 내용입니다.':
    '이번 단원과 연계된 대화 연습 내용입니다.'
}

const teachermissionhistory_ko = {
  '교사 미션 기록': '교사 미션 기록',
  '이번 단원에서 진행한 교사 미션에 대한 개별 학습자 수행 내용입니다.':
    '이번 단원에서 진행한 교사 미션에 대한 개별 학습자 수행 내용입니다.',
  '미션 수행 내역': '미션 수행 내역',
  '개별 학습 결과': '개별 학습 결과',
  진단: '진단',
  처방: '처방',
  학습중: '학습중',
  '학습이 완료되지 않았습니다.': '학습이 완료되지 않았습니다.',
  듣기: '듣기',
  읽기: '읽기',
  말하기: '말하기',
  쓰기: '쓰기',
  '교과서 대화': '교과서 대화',
  '교과 주제대화': '교과 주제대화',
  '교과 자유대화': '교과 자유대화',
  '개별 맞춤 미션': '개별 맞춤 미션',
  '단원 학습 이해도가 낮은 학생입니다. 오답을 집중적으로 복습했습니다.':
    '단원 학습 이해도가 낮은 학생입니다. 오답을 집중적으로 복습했습니다.',
  '단원에서 학습한 내용을 잘 이해하고 있습니다. AI 튜터와 영어로 대화하며, 단어에 대한 이해도를 높였습니다.':
    '단원에서 학습한 내용을 잘 이해하고 있습니다. AI 튜터와 영어로 대화하며, 단어에 대한 이해도를 높였습니다.',
  '기초가 탄탄한 학생입니다. 배운 내용을 잘 활용할 수 있도록, AI 튜터와 영어 대화를 집중적으로 연습했습니다.':
    '기초가 탄탄한 학생입니다. 배운 내용을 잘 활용할 수 있도록, AI 튜터와 영어 대화를 집중적으로 연습했습니다.',
  '기초 부족': '기초 부족',
  '기초 확립': '기초 확립',
  '기초 완성': '기초 완성',
  'AI 대화': 'AI 대화'
}

const classmanage_ko = {
  대기중: '대기중',
  듣기: '듣기',
  읽기: '읽기',
  말하기: '말하기',
  쓰기: '쓰기',
  '교과서 대화': '교과서 대화',
  '교과 주제대화': '교과 주제대화',
  '교과 자유대화': '교과 자유대화',
  '개별 맞춤 미션': '개별 맞춤 미션',
  '미션 완료': '미션 완료',
  접속중: '접속중',
  학습중: '학습중',
  '미션 진행률': '미션 진행률',
  '현재 활동': '현재 활동',
  미접속: '미접속',
  새로고침: '새로고침',
  '전체 로그아웃': '전체 로그아웃',
  '닉네임 없음': '닉네임 없음',
  '오늘의 미션': '오늘의 미션',
  'AI 대화': 'AI 대화',
  'AI 튜터': 'AI 튜터',
  '나만의 미션': '나만의 미션',
  '행성 탐험': '행성 탐험',
  '미션 화면': '미션 화면',
  '오늘의 미션이 있습니다.': '오늘의 미션이 있습니다.',
  "학생들에게 미션을 전송하고, 시작하려면 'START' 버튼을 눌러주세요.":
    "학생들에게 미션을 전송하고, 시작하려면 'START' 버튼을 눌러주세요.",
  '미션 전송 후, 1분 뒤 미션이 시작되며 미션 외 콘텐츠 이용이 제한됩니다.':
    '미션 전송 후, 1분 뒤 미션이 시작되며 미션 외 콘텐츠 이용이 제한됩니다.',
  "오늘의 미션이 없습니다. 미션 설정은 '수업 설정'에서 가능합니다.":
    "오늘의 미션이 없습니다. 미션 설정은 '수업 설정'에서 가능합니다.",
  '* 미션중 이용 제한 콘텐츠 : 퀘스트, 공사, 놀러가기, 게임존, 아이템샵 3종 (의상,라이딩,표정)':
    '* 미션중 이용 제한 콘텐츠 : 퀘스트, 공사, 놀러가기, 게임존, 아이템샵 3종 (의상,라이딩,표정)',
  '로그아웃 진행중': '로그아웃 진행중',
  '현재 학급 전체 로그아웃을 진행할까요?':
    '현재 학급 전체 로그아웃을 진행할까요?',
  '학생들에게 알림이 가고,': '학생들에게 알림이 가고,',
  '30초 후부터 로그아웃 처리가 됩니다.': '30초 후부터 로그아웃 처리가 됩니다.',
  취소: 'Cancel',
  확인: 'Ok',
  도서관: '도서관',
  레이싱: '레이싱',
  레코드: '레코드',
  회: '회',
  'GPT 주제대화': 'GPT 주제대화',
  'GPT 자유대화': 'GPT 자유대화'
}

const chart_ko = {
  나: '나',
  반평균: '반평균',
  단원: '단원',
  철자: '철자',
  어순: '어순',
  의미: '의미',
  말하기: '말하기',
  소리: '소리'
}

const classsetting_ko = {
  '학습 단원 설정': '학습 단원 설정',
  'GPT 대화 주제 설정': 'GPT 대화 주제 설정',
  '학습할 단원 설정이 가능합니다.': '학습할 단원 설정이 가능합니다.',
  교과서: '교과서',
  학년: '학년',
  반: '반',
  '대화 주제 설정': '대화 주제 설정',
  '대화 주제를 선생님이 직접 설정할 수 있습니다.':
    '대화 주제를 선생님이 직접 설정할 수 있습니다.',
  '단원 미션 설정': '단원 미션 설정',
  '단원별 미션 활동 설정 및 기록을 확인할 수 있습니다.':
    '단원별 미션 활동 설정 및 기록을 확인할 수 있습니다.',
  진행률: '진행률',
  '학습 내용': '학습 내용',
  단어: '단어',
  문장: '문장',
  '교사 미션 생성': '교사 미션 생성',
  '미션 선택': '미션 선택',
  '필수 : 액티비티 2~4개': '필수 : 액티비티 2~4개',
  '선택 : AI대화 1개': '선택 : AI대화 1개',
  듣기: '듣기',
  읽기: '읽기',
  말하기: '말하기',
  쓰기: '쓰기',
  '교과서 대화': '교과서 대화',
  'GPT 교과 주제대화': 'GPT 교과 주제대화',
  'GPT 교과 자유대화': 'GPT 교과 자유대화',
  '개별 맞춤 미션': '개별 맞춤 미션',
  '횟수 설정': '횟수 설정',
  '미션별 횟수 설정 (1-3회)': '미션별 횟수 설정 (1-3회)',
  'GPT 대화 횟수': 'GPT 대화 횟수',
  '미션 1회는 5턴 대화입니다. 예를 들어, 2회 설정 시 10턴 대화 미션이 설정됩니다.':
    '미션 1회는 3턴 대화입니다. 예를 들어, 2회 설정 시 6턴 대화 미션이 설정됩니다.',
  '액티비티 학습 결과를 바탕으로 맞춤 학습 미션을 제시합니다.':
    '액티비티 학습 결과를 바탕으로 맞춤 학습 미션을 제시합니다.',
  초기화: '초기화',
  '미션 견적내기': '미션 견적내기',
  '교사 미션 기록': '교사 미션 기록',
  "'완료' 처리된 미션을 확인할 수 있습니다.":
    "'완료' 처리된 미션을 확인할 수 있습니다.",
  스톤: '스톤',
  골드: '골드',
  날짜: '날짜',
  주제: '주제',
  보상: '보상',
  '평균 미션 진행률': '평균 미션 진행률',
  결과화면: '결과화면',
  '미션 순서 및 횟수': '미션 순서 및 횟수',
  '예상 단원학습 진행률': '예상 단원학습 진행률',
  '미션 순서': '미션 순서',
  '예상 소요시간': '예상 소요시간',
  '최대 보상 수': '최대 보상 수',
  '보상 설정': '보상 설정',
  '보상 담기': '보상 담기',
  '담은 보상': '담은 보상',
  '미션 유효 시간은': '미션 유효 시간은',
  '전송 시점 ~ 자정': '전송 시점 ~ 자정',
  '까지 입니다.': '까지 입니다.',
  '교사 미션은': '교사 미션은',
  '학급당 1일 1회': '학급당 1일 1회',
  '만 설정 가능합니다.': '만 설정 가능합니다.',
  수정하기: '수정하기',
  '이대로 미션 설정': '이대로 미션 설정',
  '듣기 스톤': '듣기 스톤',
  '읽기 스톤': '읽기 스톤',
  '말하기 스톤': '말하기 스톤',
  '쓰기 스톤': '쓰기 스톤',
  '골드 (챗봇)': '골드 (챗봇)',
  "'수업 보기' 화면에서 상세 내용을 확인해주세요.":
    "'수업 보기' 화면에서 상세 내용을 확인해주세요.",
  '수업보기 바로가기': '수업보기 바로가기',
  '교사 미션 삭제': '교사 미션 삭제',
  '듣기-읽기-말하기-쓰기-AI 대화 순으로 자동 설정됩니다.':
    '듣기-읽기-말하기-쓰기-AI 대화 순으로 자동 설정됩니다.',
  '교사 설정 주제가 있다면, 교사 설정 주제로 진행됩니다.':
    '교사 설정 주제가 있다면, 교사 설정 주제로 진행됩니다.',
  '필수 미션을 2개 이상 설정해주세요.': '필수 미션을 2개 이상 설정해주세요.',
  월: '월',
  화: '화',
  수: '수',
  목: '목',
  금: '금',
  토: '토',
  일: '일',
  회: '회',
  'AI 대화': 'AI 대화',
  '삭제 성공': '삭제 성공',
  '교사 미션이 삭제되었습니다.': '교사 미션이 삭제되었습니다.',
  '원활한 이용을 위해 모든 반 학생 접속을 종료합니다.':
    '원활한 이용을 위해 모든 반 학생 접속을 종료합니다.',
  개: '개',
  분: '분',
  '스톤 보상을 설정해주세요!': '스톤 보상을 설정해주세요!',
  '골드 보상을 설정해주세요!': '골드 보상을 설정해주세요!',
  '교사 미션이 설정되었습니다.': '교사 미션이 설정되었습니다.',
  확인: '확인',
  취소: '취소',
  '현재 진행중인 미션과 개별 미션 기록이 삭제됩니다.':
    '현재 진행중인 미션과 개별 미션 기록이 삭제됩니다.',
  '학습한 내역은 정상적으로 기록됩니다.':
    '학습한 내역은 정상적으로 기록됩니다.',
  '미션 삭제': '미션 삭제',
  '단원 설정이 저장되었습니다.': '단원 설정이 저장되었습니다.',
  단원: '단원'
}

const lessonsetting_ko = {
  '전체 선택/해제': '전체 선택/해제',
  '현재 선택된 단원': '현재 선택된 단원',
  '학습 단원 설정': '학습 단원 설정',
  '열려 있는 단원에서만 액티비티 학습 활동을 할 수 있습니다. 집중 학습할 단원만 선택해주세요.':
    '열려 있는 단원에서만 액티비티 학습 활동을 할 수 있습니다. 집중 학습할 단원만 선택해주세요.',
  저장하기: '저장하기',
  '단원 설정이 저장되었습니다.': '단원 설정이 저장되었습니다.'
}

const gptsetting_ko = {
  'GPT 대화 주제 설정': 'GPT 대화 주제 설정',
  'GPT와 나눌 대화의 주제를 직접 설정할 수 있습니다.':
    'GPT와 나눌 대화의 주제를 직접 설정할 수 있습니다.',
  '선생님 추천 주제 설정': '선생님 추천 주제 설정',
  '교사 작성 영역': '교사 작성 영역',
  '아래 내용을 입력하면 구체적인 상황, 학생 역할, 영어 주제가 생성됩니다.':
    '아래 내용을 입력하면 구체적인 상황, 학생 역할, 영어 주제가 생성됩니다.',
  '주제 키워드': '주제 키워드',
  'GPT 역할': 'GPT 역할',
  'GPT 대화 설정 내역': 'GPT 대화 설정 내역',
  날짜: '날짜',
  주제: '주제',
  상세: '상세',
  '예: 하루 일과 어땠는지 대화 해보기, 학교 끝나고 어떤 활동 하는지 대화 해보기':
    '예: 하루 일과 어땠는지 대화 해보기, 학교 끝나고 어떤 활동 하는지 대화 해보기',
  '예: 엄마, 친한 친구, 선생님, 동생': '예: 엄마, 친한 친구, 선생님, 동생',
  'GPT로 구체화하기': 'GPT로 구체화하기',
  '생성 결과': '생성 결과',
  '입력하신 내용을 바탕으로 구체화된 주제입니다.':
    '입력하신 내용을 바탕으로 구체화된 주제입니다.',
  '학생 역할': '학생 역할',
  상황: '상황',
  초기화: '초기화',
  '주제 설정하기': '주제 설정하기',
  '주제 키워드를 입력해주세요.': '주제 키워드를 입력해주세요.',
  'GPT 역할을 입력해주세요.': 'GPT 역할을 입력해주세요.',
  'GPT 주제 설정 중 오류가 발생하였습니다.':
    'GPT 주제 설정 중 오류가 발생하였습니다.',
  'GPT 주제가 설정되었습니다.': 'GPT 주제가 설정되었습니다.',
  '교사 주제 설정': '교사 주제 설정',
  '사용할 수 없는 주제 키워드입니다.': '사용할 수 없는 주제 키워드입니다.'
}

const library_ko = {
  '도서 설정': '도서 설정',
  '도서 열람': '도서 열람',
  '도서 상세 정보를 확인할 수 있습니다.':
    '도서 상세 정보를 확인할 수 있습니다.',
  '학생 독서 현황': '학생 독서 현황',
  '학생들의 개별 독서 현황을 확인합니다.':
    '학생들의 개별 독서 현황을 확인합니다.',
  '무료체험 도서': '무료체험 도서',
  '학생들의 수준에 맞게 읽을 수 있는 스탠다드 플랜 대상 무료체험 도서입니다.':
    '학생들의 수준에 맞게 읽을 수 있는 스탠다드 플랜 대상 무료체험 도서입니다.',
  '교과연계 도서': '교과연계 도서',
  '전체 도서': '전체 도서',
  '교과 단원과 연계된 도서를 단원별로 보여줍니다.':
    '교과 단원과 연계된 도서를 단원별로 보여줍니다.',
  검색: '검색',
  '전체 도서를 레벨별로 볼 수 있으며, 도서명을 검색할 수 있습니다.':
    '전체 도서를 레벨별로 볼 수 있으며, 도서명을 검색할 수 있습니다.',
  '책 이름을 입력해주세요.': '책 이름을 입력해주세요.',
  전체: '전체',
  'Standard 플랜의 독서 현황은 현재 준비중입니다.':
    'Standard 플랜의 독서 현황은 현재 준비중입니다.',
  '읽고 있는 책': '읽고 있는 책',
  'Read 완독 책': 'Read 완독 책',
  '읽고 있는 책을 최신순으로 보여줍니다.':
    '읽고 있는 책을 최신순으로 보여줍니다.',
  'Read 모드로 완독한 책을 모두 보여줍니다. 최초 완독일이 가장 최신인 책부터 정렬됩니다.':
    'Read 모드로 완독한 책을 모두 보여줍니다. 최초 완독일이 가장 최신인 책부터 정렬됩니다.',
  'Read 모드 완독한 책': 'Read 모드 완독한 책',
  '검색어를 입력해주세요.': '검색어를 입력해주세요.',
  '우리반 독서 정보': '우리반 독서 정보',
  '학생들이 읽은 책 정보를 한눈에 볼 수 있습니다.':
    '학생들이 읽은 책 정보를 한눈에 볼 수 있습니다.',
  '도서별 상세 정보': '도서별 상세 정보',
  '학습용 도서의 상세 정보를 확인할 수 있습니다.':
    '학습용 도서의 상세 정보를 확인할 수 있습니다.',
  '인기 도서 Top 3': '인기 도서 Top 3',
  주간: '주간',
  전체: '전체',
  '전체 독서 활동': '전체 독서 활동',
  '개별 평균 (권)': '개별 평균 (권)',
  '반 누적 (권)': '반 누적 (권)',
  '총 발화 문장': '총 발화 문장',
  '월별 독서량': '월별 독서량',
  '완독 횟수': '완독 횟수',
  '독서 퀴즈 결과': '독서 퀴즈 결과',
  '주간 독서 랭킹': '주간 독서 랭킹',
  랭킹: '랭킹',
  이름: '이름',
  '주간 독서량 (권)': '주간 독서량 (권)',
  '누적 독서량 (권)': '누적 독서량 (권)',
  '기준 날짜': '기준 날짜',
  화: '화',
  월: '월',
  '매주 화요일 랭킹 갱신': '매주 화요일 랭킹 갱신',
  '교과서 연계 독서활동': '교과서 연계 독서활동',
  '회 완독': '회 완독',
  '1위': '1위',
  '2위': '2위',
  '3위': '3위',
  '최근 열람 도서': '최근 열람 도서',
  '월별 독서 횟수': '월별 독서 횟수',
  '레벨로 보는 독서활동': '레벨로 보는 독서활동',
  '교과서 연계 독서활동': '교과서 연계 독서활동',
  '완독 책 (권)': '완독 책 (권)',
  '누적 독서 (회)': '누적 독서 (회)',
  요약: '요약',
  '전체독서 활동': '전체독서 활동',
  '학생 독서 현황': '학생 독서 현황',
  '개별 학생들의 독서 정보를 한눈에 볼 수 있습니다.':
    '개별 학생들의 독서 정보를 한눈에 볼 수 있습니다.',
  완독횟수: '완독횟수',
  '월 단위': '월 단위',
  '반 평균': '반 평균',
  본인: '본인',
  '최신 열람순': '최신 열람순',
  '열람한 책': '열람한 책',
  총: '총',
  권: '권',
  독: '독'
}

const library_modal_ko = {
  도서정보: '도서정보',
  'e-book 보기': 'e-book 보기',
  작가: '작가',
  '레벨 분류': '레벨 분류',
  추천대상: '추천대상',
  '총 단어수': '총 단어수',
  페이지수: '페이지수',
  학습활동: '학습활동',
  '줄거리 요약': '줄거리 요약',
  '성우 녹음 들으며 책 읽기': '성우 녹음 들으며 책 읽기',
  '직접 문장을 따라 책 읽기': '직접 문장을 따라 책 읽기',
  '책 내용의 이해도 확인하는 퀴즈': '책 내용의 이해도 확인하는 퀴즈',
  '주요 문장 듣고 따라하기': '주요 문장 듣고 따라하기',
  '*현재 Read 학습만 제공되며, 다른 활동은 순차적으로 오픈될 예정입니다.':
    '*현재 Read 학습만 제공되며, 다른 활동은 순차적으로 오픈될 예정입니다.',
  'e-book 보기는 프리미엄 플랜만 제공됩니다.':
    'e-book 보기는 프리미엄 플랜만 제공됩니다.',
  '활동 내역이 없습니다.': '활동 내역이 없습니다.',
  더보기: '더보기',
  '평가 상세': '평가 상세',
  활동: '활동',
  날짜: '날짜',
  정확도: '정확도',
  독서활동: '독서활동',
  '3학년 이상': '3학년 이상',
  결과: '결과',
  일시: '일시',
  회독: '회독',
  접기: '접기',
  '회차 완독': '회차 완독',
  '완벽 이해': '완벽 이해',
  보통: '보통',
  '이해 부족': '이해 부족',
  '발음 정확도': '발음 정확도'
}

const setting_side_ko = {
  '계약 정보': '계약 정보',
  '알공 계정 관리': '알공 계정 관리',
  '전학생 추가': '전학생 추가',
  '내정보 수정': '내정보 수정',
  초등학교: '초등학교',
  선생님: '선생님'
}

const setting_contract_ko = {
  '계약 정보': '계약 정보',
  '학교 계약 정보를 한눈에 확인할 수 있습니다.':
    '학교 계약 정보를 한눈에 확인할 수 있습니다.',
  '학교 정보': '학교 정보',
  교육청: '교육청',
  '학교 이름': '학교 이름',
  코드: '코드',
  '결제 상태': '결제 상태',
  '계정발급 상태': '계정발급 상태',
  요금제: '요금제',
  결제방법: '결제방법',
  '계약 상세': '계약 상세',
  '계약 시작일': '계약 시작일',
  '계약 만료일': '계약 만료일',
  특이사항: '특이사항',
  '계약 학생 수': '계약 학생 수',
  '현재 학생 수': '현재 학생 수',
  학급수: '학급수',
  '학급 정보': '학급 정보',
  학년: '학년',
  반: '반',
  출판사: '출판사',
  '학생 수': '학생 수',
  영어교사: '영어교사',
  담임교사: '담임교사',
  초등학교: '초등학교',
  '방학기간 서비스 이용': '방학기간 서비스 이용',
  '방학기간 서비스 이용 중단': '방학기간 서비스 이용 중단'
}

const setting_manage_ko = {
  '학생 계정 관리': '학생 계정 관리',
  '학생들의 비밀번호를 초기화하거나, 닉네임을 변경할 수 있습니다.':
    '학생들의 비밀번호를 초기화하거나, 닉네임을 변경할 수 있습니다.',
  '* 최초 비밀번호 : 000000': '* 최초 비밀번호 : 000000',
  '학급을 선택해주세요': '학급을 선택해주세요',
  번호: '번호',
  구분: '구분',
  이름: '이름',
  아이디: '아이디',
  닉네임: '닉네임',
  '비밀번호 초기화': '비밀번호 초기화',
  '닉네임 변경': '닉네임 변경',
  '비밀번호를 초기화 하시겠습니까?': '비밀번호를 초기화 하시겠습니까?',
  취소: '취소',
  확인: '확인',
  '비밀번호 변경 완료!': '비밀번호 변경 완료!',
  "'000000'으로 로그인 후,": "'000000'으로 로그인 후,",
  '새로운 비밀번호를 설정해주세요.': '새로운 비밀번호를 설정해주세요.',
  '닉네임 변경': '닉네임 변경',
  '* 영문/국문/숫자 가능 (8자리 이하)': '* 영문/국문/숫자 가능 (8자리 이하)',
  '닉네임 변경 완료!': '닉네임 변경 완료!',
  '앱 재실행 시 변경된 닉네임으로 적용됩니다.':
    '앱 재실행 시 변경된 닉네임으로 적용됩니다.',
  '닉네임을 입력해주세요.': '닉네임을 입력해주세요.',
  '비속어는 사용할 수 없습니다.': '비속어는 사용할 수 없습니다.',
  '중복된 닉네임은 사용할 수 없습니다.': '중복된 닉네임은 사용할 수 없습니다.'
}

const setting_transfer_ko = {
  '전학생 추가': '전학생 추가',
  "전학생은 '결제 학생'의 5%까지 추가 가능합니다.":
    "전학생은 '결제 학생'의 5%까지 추가 가능합니다.",
  '전학생 추가 신청': '전학생 추가 신청',
  신청하기: '신청하기',
  '학급 선택': '학급 선택',
  번호: '번호',
  이름: '이름',
  'ID (자동생성)': 'ID (자동생성)',
  '전학생 추가 신청 내역': '전학생 추가 신청 내역',
  '신청 날짜': '신청 날짜',
  '신청 교사': '신청 교사',
  '전학생 학급': '전학생 학급',
  번호: '번호',
  이름: '이름',
  '처리 결과': '처리 결과',
  '처리 날짜': '처리 날짜',
  대기중: '대기중',
  반려: '반려',
  '발급 완료': '발급 완료',
  '신청 가능한 전학생 수를 초과했습니다.':
    '신청 가능한 전학생 수를 초과했습니다.',
  '신청 학생의 정보를 모두 입력해주세요.':
    '신청 학생의 정보를 모두 입력해주세요.',
  '이미 신청내역이 있습니다.': '이미 신청내역이 있습니다.',
  '정보를 확인해주세요.': '정보를 확인해주세요.',
  '중복된 출석번호는 사용할 수 없습니다.':
    '중복된 출석번호는 사용할 수 없습니다.',
  '발급 신청이 완료되었습니다.': '발급 신청이 완료되었습니다.',
  '이미 존재하는 학생 정보입니다.': '이미 존재하는 학생 정보입니다.',
  '학급과 번호를 확인해주세요.': '학급과 번호를 확인해주세요.',
  '오류가 발생하였습니다.': '오류가 발생하였습니다.',
  '명 추가 가능합니다.': '명 추가 가능합니다.',
  '명 추가되었습니다.': '명 추가되었습니다.'
}

const setting_info_ko = {
  '내 정보 수정': '내 정보 수정',
  '계정 정보, 연락처 등 내 정보를 수정합니다.':
    '계정 정보, 연락처 등 내 정보를 수정합니다.',
  이름: '이름',
  '계정 정보': '계정 정보',
  '비밀번호 변경': '비밀번호 변경',
  이메일: '이메일',
  수정: '수정',
  전화번호: '전화번호',
  '존재하지 않는 아이디입니다.': '존재하지 않는 아이디입니다.',
  '비밀번호가 일치하지 않습니다.': '비밀번호가 일치하지 않습니다.',
  '영문/숫자 6자리 이상으로 설정해주세요.':
    '영문/숫자 6자리 이상으로 설정해주세요.',
  '비밀번호 변경이 완료되었습니다.': '비밀번호 변경이 완료되었습니다.',
  '안정적인 사용을 위해 다시 로그인해주세요.':
    '안정적인 사용을 위해 다시 로그인해주세요.',
  '핸드폰 번호를 입력해주세요': '핸드폰 번호를 입력해주세요',
  '인증번호를 다시 입력해주세요': '인증번호를 다시 입력해주세요',
  '인증번호 유효시간': '인증번호 유효시간',
  '전화번호 변경 완료되었습니다.': '전화번호 변경 완료되었습니다.',
  '이메일 형식에 맞게 입력해주세요.': '이메일 형식에 맞게 입력해주세요.',
  '이메일이 성공적으로 변경되었습니다.': '이메일이 성공적으로 변경되었습니다.',
  '이메일 변경 중 오류가 발생하였습니다.':
    '이메일 변경 중 오류가 발생하였습니다.',
  '입력시간이 초과되었습니다. 인증번호를 다시 받아주세요.':
    '입력시간이 초과되었습니다. 인증번호를 다시 받아주세요.',
  변경: '변경',
  '인증번호를 입력해주세요.': '인증번호를 입력해주세요.',
  인증: '인증',
  재전송: '재전송',
  확인: '확인',
  '이름을 입력해주세요.': '이름을 입력해주세요.',
  '전화번호를 입력해주세요.': '전화번호를 입력해주세요.',
  '이메일 정보 수정을 위해 이메일을 입력해주세요.':
    '이메일 정보 수정을 위해 이메일을 입력해주세요.',
  '위와 동일한 비밀번호 입력': '위와 동일한 비밀번호 입력',
  '새 비밀번호': '새 비밀번호',
  '새 비밀번호 입력': '새 비밀번호 입력',
  '새 비밀번호 확인': '새 비밀번호 확인',
  '변경할 비밀번호를 입력해주세요': '변경할 비밀번호를 입력해주세요',
  '본인 확인을 위해 비밀번호를 다시 입력해주세요.':
    '본인 확인을 위해 비밀번호를 다시 입력해주세요.',
  '본인 확인': '본인 확인',
  아이디: '아이디',
  비밀번호: '비밀번호',
  '영문/숫자 6자리 이상': '영문/숫자 6자리 이상',
  '변경할 전화번호 인증이 필요합니다.': '변경할 전화번호 인증이 필요합니다.'
}

export {
  login_ko,
  topmenu_ko,
  footer_ko,
  learningstatus_ko,
  learningdetail_ko,
  pron_ko,
  conversation_ko,
  teachermissionhistory_ko,
  classmanage_ko,
  chart_ko,
  lessonsetting_ko,
  gptsetting_ko,
  classsetting_ko,
  library_ko,
  library_modal_ko,
  setting_side_ko,
  setting_contract_ko,
  setting_info_ko,
  setting_manage_ko,
  setting_transfer_ko
}
